import nodemailer from 'nodemailer';
import 'dotenv/config';

const { UKRNET_PASSWORD } = process.env;

const nodemailerConfig = {
    host: 'smtp.ukr.net',
    port: 465,
    secure: true,
    auth: {
        user: "taras.papka@ukr.net",
        pass: UKRNET_PASSWORD,
    }
};

const transport = nodemailer.createTransport(nodemailerConfig)
const email = {
    to: 'taras.papka@gmail.com',
    from: 'taras.papka@ukr.net',
    subject: 'test mail',
    html: "<p>Test mail from localhost</p>",
}
transport.sendMail(email)
    .then(() => { console.log('Email successfully delivered') })
    .catch((error)=>{console.log(error.message)})
/*
Якщо хочете використовувати SMTP-сервери UKR.NET, то вкажіть:

    адресу сервера вихідних листів (SMTP): smtp.ukr.net;
    порт 465 (якщо з'єднання за 465-м портом заблоковано, 
    можна також використовувати порт 2525);
    тип з'єднання - захищене SSL або TLS.

Також треба вказати необхідність авторизації на SMTP-сервері з такими параметрами:

    як ім’я користувача (логін) вкажіть повну адресу email 
    (наприклад, user@ukr.net), як пароль - пароль, згенерований у 
    розділі «Керування IMAP-доступом» у Налаштуваннях вашої скриньки. 
    Адресу вводьте тільки малими (рядковими) літерами;
    у загальних налаштуваннях облікового запису скриньки ukr.net для поля 
    “адреса відправника” (“from” або “від кого”) необхідно вказати свою 
    адресу email. Ця адреса повинна збігатися з тією, що ви вказали в полі 
    “ім'я користувача” для авторизації на SMTP-сервері;
    безпечну перевірку пароля (SPA) включати не потрібно (не плутайте із 
        захищеним підключенням TLS або SSL, яке для SMTP-сервера повинно 
        бути увімкненим).

Під час надсилання листів через SMTP-сервер мобільного оператора (або інтернет-провайдера) ви не будете отримувати листи зі сповіщеннями про недоставлення надісланих листів, якщо, наприклад, помилково надішлете лист на адресу, що не існує (листи від Mail Delivery System), оскільки сервери UKR.NET не приймають такі повідомлення від інших серверів. Якщо надсилання листів буде здійснюватися через сервер smtp.ukr.net, тоді у випадку неможливості доставлення листа адресату ви зможете отримати лист зі звітом про причини недоставлення. 
*/